# Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями. Створiть просту умовну конструкцiю
# (звiсно вона повинна бути в тiлi ф-цiї), пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" та
# у випадку нервіності - виводити ще і різницю.
#     Повиннi опрацювати такi умови (x, y, z заміність на відповідні числа):
#     x > y;       вiдповiдь - "х бiльше нiж у на z"
#     x < y;       вiдповiдь - "у бiльше нiж х на z"
#     x == y.      вiдповiдь - "х дорiвнює z"

def compare_numbers(number1, number2):
    if number1 > number2:
        print(f"x більше ніж y на {number1 - number2}")
    elif number1 < y:
        print(f"y більше ніж x на {number2 - number1}")
    else:
        print("x дорівнює z")


x = float(input("Введіть значення x: "))
y = float(input("Введіть значення y: "))

compare_numbers(x, y)
